import numpy as np  #імпортуємо numpy
#1(виведіть на екран елементи лінійного масиву (заданий користувачем) у зворотному порядку)
e=np.array([2,4,5,6,8,9])  #наш лінійний масив
print(e)  #виведемо наш масив на екран
r=e[::-1]  #за допомогою оператора вилучення зрізу, зробимо, щоб елементи масиву були у зворотному порядку
print(r)  #виведемо наш масив у зворотному порядку
print('______________')
#або ще такий варіант
q=np.array([[2,3,5,7,],[4,8,9,1]])
print(q)
w=q[::-1,::-1]
print(w)
