import numpy as np
#2(виведіть на екран транспоновану матрицю 3*3 (початкова матриця задана користувачем))
d = np.array([[1,2,3],[4,5,6],[7,8,9]])  #задана матриця
print(d)  #виведемо нашу матрицю
print(d.T)  #за допомогою .T виведемо вже транспоновану матрицю
#  .T це скоріше знов все ж таки метод, але я потратив 2 дні, щоб розібратися з цими масивами і алгоритмами пошуку і
# заодно дописував звіт, я знаю шо цей код треба переробити якось по другому і на це було 3 тижні, але
# мені капец як стало лень його зараз переробляти, тому я лишу його таким. Наталія Артурівно, якшо ви це
# читаєте то я вибачаюсь і бажаю вам гарного дня:)

