import random  #Імпортуємо рандом
a = [random.randint(-10, 10) for j in range(int(input('Введіть розмір масиву: ')))]  #Потім за допомогою randint
#  вирішуємо від якого числа по яке можуть бути в нашому масиві. І в кінці вводимо розмір нашого масиву
x = int(input('Введіть шуканий елемент: '))  #вводимо елемент, який ми хочемо знайти
print(a)  #виводимо наш масив на екран

n = len(a)  #підраховуємо кількість елементів в нашому масиві
i = 1 #позиція елемента
u = 1
while i < n and a[i] != x:  #проходимо по нашому масиві і порівнюємо шуканий елемент, якщо позиція елемента
    #менша за кількість всіх елементів і порівнюваний елемент не дорівнює шуканому, то збільшуємо позицію елемента на 1
    i += 1  #збільшення позиції
    u += 1  #збільшення порівнянь

if i == n:  #якщо кількість позицій дорівнює кількості елементів у масиві, то
    print('Елемент не знайдений')  #виводимо 'Елемент не знайдений'
    print(f'Всього було проведено {u} порівнянь')  #та кількість проведених порівнянь
else:  #інашке виводимо
    print(f'На позиції {i} знайдений елемент {x}')  #на якій позицій був знайдений наш шуканий елемент
    print(f'Всього було проведено {u} порівнянь')  #та кількість проведених порівнянь
