t = input('Введіть рядок: ')  #рядок
t1 = input('Введіть шуканий підрядок: ')  #підрядок

i = -1  #відповідає за всі індекси рядка
j = 0  #відповідає за всі індекси підрядка

while (j < len(t1)) and i < (len(t) - len(t1)):  #поки j менше ніж довжина рядка та поки i менше різниці рядка й
    #підрядка, умова буде здійснюватись. Якщо підрядок не буде знайдений в рядку, умова видасть False
    j = 0  #буде циклічно обнулятися
    i += 1  #i буде збільшуватись поки підрядок не буде знайдений в рядку
    while (j < len(t1)) and t1[j] == t[i + j]:  #поки j буде менше довжини рядка та поки елемент підрядка по індексу j
        #буде дорівнювати елементові рядка по сумі індексів i й j, умова буде виконуватись
        j += 1

if (j == len(t1)):  #якщо індекс j дорівнює довжині підрядка, то підрядок знайдений
    print(f'Підрядок знайдений на позиції {i}')  #й виводимо 'Підрядок знайдений на позиції {i}'
else:  #в іншому випадку підрядок не буде знайдений,
    print('Підрядок не знайдений')  #тоді виводимо 'Підрядок не знайдений'
#Тут я за порівняння не знав, такшо рішив нічого не добавляти
